#![allow(non_upper_case_globals)]
#![allow(non_snake_case)]

use std::os::raw::{c_char, c_int, c_uint, c_void};

pub const CorsairLedId_CLI_Invalid: CorsairLedId = 0;
pub const CorsairLedId_CLK_Escape: CorsairLedId = 1;
pub const CorsairLedId_CLK_F1: CorsairLedId = 2;
pub const CorsairLedId_CLK_F2: CorsairLedId = 3;
pub const CorsairLedId_CLK_F3: CorsairLedId = 4;
pub const CorsairLedId_CLK_F4: CorsairLedId = 5;
pub const CorsairLedId_CLK_F5: CorsairLedId = 6;
pub const CorsairLedId_CLK_F6: CorsairLedId = 7;
pub const CorsairLedId_CLK_F7: CorsairLedId = 8;
pub const CorsairLedId_CLK_F8: CorsairLedId = 9;
pub const CorsairLedId_CLK_F9: CorsairLedId = 10;
pub const CorsairLedId_CLK_F10: CorsairLedId = 11;
pub const CorsairLedId_CLK_F11: CorsairLedId = 12;
pub const CorsairLedId_CLK_GraveAccentAndTilde: CorsairLedId = 13;
pub const CorsairLedId_CLK_1: CorsairLedId = 14;
pub const CorsairLedId_CLK_2: CorsairLedId = 15;
pub const CorsairLedId_CLK_3: CorsairLedId = 16;
pub const CorsairLedId_CLK_4: CorsairLedId = 17;
pub const CorsairLedId_CLK_5: CorsairLedId = 18;
pub const CorsairLedId_CLK_6: CorsairLedId = 19;
pub const CorsairLedId_CLK_7: CorsairLedId = 20;
pub const CorsairLedId_CLK_8: CorsairLedId = 21;
pub const CorsairLedId_CLK_9: CorsairLedId = 22;
pub const CorsairLedId_CLK_0: CorsairLedId = 23;
pub const CorsairLedId_CLK_MinusAndUnderscore: CorsairLedId = 24;
pub const CorsairLedId_CLK_Tab: CorsairLedId = 25;
pub const CorsairLedId_CLK_Q: CorsairLedId = 26;

pub const CorsairLogicalLayout_CLL_JP: CorsairLogicalLayout = 15;
pub const CorsairLogicalLayout_CLL_KR: CorsairLogicalLayout = 16;
pub const CorsairLogicalLayout_CLL_TW: CorsairLogicalLayout = 17;
pub const CorsairLogicalLayout_CLL_MEX: CorsairLogicalLayout = 18;
pub type CorsairLogicalLayout = u32;
pub const CorsairDeviceCaps_CDC_None: CorsairDeviceCaps = 0;
pub const CorsairDeviceCaps_CDC_Lighting: CorsairDeviceCaps = 1;
pub const CorsairDeviceCaps_CDC_PropertyLookup: CorsairDeviceCaps = 2;
pub type CorsairDeviceCaps = u32;
pub const CorsairAccessMode_CAM_ExclusiveLightingControl: CorsairAccessMode = 0;
pub type CorsairAccessMode = u32;
pub const CorsairError_CE_Success: CorsairError = 0;
pub const CorsairError_CE_ServerNotFound: CorsairError = 1;
pub const CorsairError_CE_NoControl: CorsairError = 2;
pub const CorsairError_CE_ProtocolHandshakeMissing: CorsairError = 3;
pub const CorsairError_CE_IncompatibleProtocol: CorsairError = 4;
pub const CorsairError_CE_InvalidArguments: CorsairError = 5;
pub type CorsairError = u32;
pub const CorsairChannelDeviceType_CCDT_Invalid: CorsairChannelDeviceType = 0;
pub const CorsairChannelDeviceType_CCDT_HD_Fan: CorsairChannelDeviceType = 1;
pub const CorsairChannelDeviceType_CCDT_SP_Fan: CorsairChannelDeviceType = 2;
pub const CorsairChannelDeviceType_CCDT_LL_Fan: CorsairChannelDeviceType = 3;
pub const CorsairChannelDeviceType_CCDT_ML_Fan: CorsairChannelDeviceType = 4;
pub const CorsairChannelDeviceType_CCDT_Strip: CorsairChannelDeviceType = 5;
pub const CorsairChannelDeviceType_CCDT_DAP: CorsairChannelDeviceType = 6;
pub const CorsairChannelDeviceType_CCDT_Pump: CorsairChannelDeviceType = 7;
pub const CorsairChannelDeviceType_CCDT_QL_Fan: CorsairChannelDeviceType = 8;
pub type CorsairChannelDeviceType = u32;
pub const CorsairDevicePropertyType_CDPT_Boolean: CorsairDevicePropertyType = 4096;
pub const CorsairDevicePropertyType_CDPT_Int32: CorsairDevicePropertyType = 8192;
pub type CorsairDevicePropertyType = u32;
pub const CorsairDevicePropertyId_CDPI_Headset_MicEnabled: CorsairDevicePropertyId = 4096;
pub const CorsairDevicePropertyId_CDPI_Headset_SurroundSoundEnabled: CorsairDevicePropertyId = 4097;
pub const CorsairDevicePropertyId_CDPI_Headset_SidetoneEnabled: CorsairDevicePropertyId = 4098;
pub const CorsairDevicePropertyId_CDPI_Headset_EqualizerPreset: CorsairDevicePropertyId = 8192;
pub type CorsairDevicePropertyId = u32;
pub const CorsairEventId_CEI_Invalid: CorsairEventId = 0;
pub const CorsairEventId_CEI_DeviceConnectionStatusChangedEvent: CorsairEventId = 1;
pub const CorsairEventId_CEI_KeyEvent: CorsairEventId = 2;
pub type CorsairEventId = u32;
pub const CORSAIR_DEVICE_ID_MAX: c_uint = 128;
pub type CorsairDeviceId = [c_char; 128usize];

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CorsairChannelDeviceInfo {
    pub type_: CorsairChannelDeviceType,
    pub deviceLedCount: c_int,
}
#[test]
fn bindgen_test_layout_CorsairChannelDeviceInfo() {
    assert_eq!(
        ::std::mem::size_of::<CorsairChannelDeviceInfo>(),
        8usize,
        concat!("Size of: ", stringify!(CorsairChannelDeviceInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairChannelDeviceInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(CorsairChannelDeviceInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairChannelDeviceInfo>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairChannelDeviceInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairChannelDeviceInfo>())).deviceLedCount as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairChannelDeviceInfo),
            "::",
            stringify!(deviceLedCount)
        )
    );
}

unsafe impl Send for CorsairChannelInfo {}
unsafe impl Sync for CorsairChannelInfo {}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CorsairChannelInfo {
    pub totalLedsCount: c_int,
    pub devicesCount: c_int,
    pub devices: *mut CorsairChannelDeviceInfo,
}
#[test]
fn bindgen_test_layout_CorsairChannelInfo() {
    assert_eq!(
        ::std::mem::size_of::<CorsairChannelInfo>(),
        16usize,
        concat!("Size of: ", stringify!(CorsairChannelInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairChannelInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(CorsairChannelInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairChannelInfo>())).totalLedsCount as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairChannelInfo),
            "::",
            stringify!(totalLedsCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairChannelInfo>())).devicesCount as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairChannelInfo),
            "::",
            stringify!(devicesCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairChannelInfo>())).devices as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairChannelInfo),
            "::",
            stringify!(devices)
        )
    );
}

unsafe impl Send for CorsairChannelsInfo {}
unsafe impl Sync for CorsairChannelsInfo {}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CorsairChannelsInfo {
    pub channelsCount: c_int,
    pub channels: *mut CorsairChannelInfo,
}
#[test]
fn bindgen_test_layout_CorsairChannelsInfo() {
    assert_eq!(
        ::std::mem::size_of::<CorsairChannelsInfo>(),
        16usize,
        concat!("Size of: ", stringify!(CorsairChannelsInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairChannelsInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(CorsairChannelsInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairChannelsInfo>())).channelsCount as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairChannelsInfo),
            "::",
            stringify!(channelsCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairChannelsInfo>())).channels as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairChannelsInfo),
            "::",
            stringify!(channels)
        )
    );
}

unsafe impl Send for CorsairDeviceInfo {}
unsafe impl Sync for CorsairDeviceInfo {}

#[repr(C)]
#[derive(Copy, Clone)]
pub struct CorsairDeviceInfo {
    pub type_: CorsairDeviceType,
    pub model: *const c_char,
    pub physicalLayout: CorsairPhysicalLayout,
    pub logicalLayout: CorsairLogicalLayout,
    pub capsMask: c_int,
    pub ledsCount: c_int,
    pub channels: CorsairChannelsInfo,
    pub deviceId: CorsairDeviceId,
}
#[test]
fn bindgen_test_layout_CorsairDeviceInfo() {
    assert_eq!(
        ::std::mem::size_of::<CorsairDeviceInfo>(),
        176usize,
        concat!("Size of: ", stringify!(CorsairDeviceInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairDeviceInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(CorsairDeviceInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairDeviceInfo>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairDeviceInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairDeviceInfo>())).model as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairDeviceInfo),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairDeviceInfo>())).physicalLayout as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairDeviceInfo),
            "::",
            stringify!(physicalLayout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairDeviceInfo>())).logicalLayout as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairDeviceInfo),
            "::",
            stringify!(logicalLayout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairDeviceInfo>())).capsMask as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairDeviceInfo),
            "::",
            stringify!(capsMask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairDeviceInfo>())).ledsCount as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairDeviceInfo),
            "::",
            stringify!(ledsCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairDeviceInfo>())).channels as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairDeviceInfo),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairDeviceInfo>())).deviceId as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairDeviceInfo),
            "::",
            stringify!(deviceId)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CorsairLedPosition {
    pub ledId: CorsairLedId,
    pub top: f64,
    pub left: f64,
    pub height: f64,
    pub width: f64,
}
#[test]
fn bindgen_test_layout_CorsairLedPosition() {
    assert_eq!(
        ::std::mem::size_of::<CorsairLedPosition>(),
        40usize,
        concat!("Size of: ", stringify!(CorsairLedPosition))
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairLedPosition>(),
        8usize,
        concat!("Alignment of ", stringify!(CorsairLedPosition))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairLedPosition>())).ledId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairLedPosition),
            "::",
            stringify!(ledId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairLedPosition>())).top as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairLedPosition),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairLedPosition>())).left as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairLedPosition),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairLedPosition>())).height as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairLedPosition),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairLedPosition>())).width as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairLedPosition),
            "::",
            stringify!(width)
        )
    );
}

unsafe impl Send for CorsairLedPositions {}
unsafe impl Sync for CorsairLedPositions {}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CorsairLedPositions {
    pub numberOfLed: c_int,
    pub pLedPosition: *mut CorsairLedPosition,
}
#[test]
fn bindgen_test_layout_CorsairLedPositions() {
    assert_eq!(
        ::std::mem::size_of::<CorsairLedPositions>(),
        16usize,
        concat!("Size of: ", stringify!(CorsairLedPositions))
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairLedPositions>(),
        8usize,
        concat!("Alignment of ", stringify!(CorsairLedPositions))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairLedPositions>())).numberOfLed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairLedPositions),
            "::",
            stringify!(numberOfLed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairLedPositions>())).pLedPosition as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairLedPositions),
            "::",
            stringify!(pLedPosition)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CorsairLedColor {
    pub ledId: CorsairLedId,
    pub r: c_int,
    pub g: c_int,
    pub b: c_int,
}
#[test]
fn bindgen_test_layout_CorsairLedColor() {
    assert_eq!(
        ::std::mem::size_of::<CorsairLedColor>(),
        16usize,
        concat!("Size of: ", stringify!(CorsairLedColor))
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairLedColor>(),
        4usize,
        concat!("Alignment of ", stringify!(CorsairLedColor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairLedColor>())).ledId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairLedColor),
            "::",
            stringify!(ledId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairLedColor>())).r as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairLedColor),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairLedColor>())).g as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairLedColor),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairLedColor>())).b as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairLedColor),
            "::",
            stringify!(b)
        )
    );
}

unsafe impl Send for CorsairProtocolDetails {}
unsafe impl Sync for CorsairProtocolDetails {}

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CorsairProtocolDetails {
    pub sdkVersion: *const c_char,
    pub serverVersion: *const c_char,
    pub sdkProtocolVersion: c_int,
    pub serverProtocolVersion: c_int,
    pub breakingChanges: bool,
}
#[test]
fn bindgen_test_layout_CorsairProtocolDetails() {
    assert_eq!(
        ::std::mem::size_of::<CorsairProtocolDetails>(),
        32usize,
        concat!("Size of: ", stringify!(CorsairProtocolDetails))
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairProtocolDetails>(),
        8usize,
        concat!("Alignment of ", stringify!(CorsairProtocolDetails))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairProtocolDetails>())).sdkVersion as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairProtocolDetails),
            "::",
            stringify!(sdkVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairProtocolDetails>())).serverVersion as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairProtocolDetails),
            "::",
            stringify!(serverVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairProtocolDetails>())).sdkProtocolVersion as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairProtocolDetails),
            "::",
            stringify!(sdkProtocolVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairProtocolDetails>())).serverProtocolVersion as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairProtocolDetails),
            "::",
            stringify!(serverProtocolVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairProtocolDetails>())).breakingChanges as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairProtocolDetails),
            "::",
            stringify!(breakingChanges)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CorsairDeviceConnectionStatusChangedEvent {
    pub deviceId: CorsairDeviceId,
    pub isConnected: bool,
}
#[test]
fn bindgen_test_layout_CorsairDeviceConnectionStatusChangedEvent() {
    assert_eq!(
        ::std::mem::size_of::<CorsairDeviceConnectionStatusChangedEvent>(),
        129usize,
        concat!(
            "Size of: ",
            stringify!(CorsairDeviceConnectionStatusChangedEvent)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairDeviceConnectionStatusChangedEvent>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CorsairDeviceConnectionStatusChangedEvent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairDeviceConnectionStatusChangedEvent>())).deviceId
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairDeviceConnectionStatusChangedEvent),
            "::",
            stringify!(deviceId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairDeviceConnectionStatusChangedEvent>())).isConnected
                as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairDeviceConnectionStatusChangedEvent),
            "::",
            stringify!(isConnected)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CorsairKeyEvent {
    pub deviceId: CorsairDeviceId,
    pub keyId: CorsairKeyId,
    pub isPressed: bool,
}
#[test]
fn bindgen_test_layout_CorsairKeyEvent() {
    assert_eq!(
        ::std::mem::size_of::<CorsairKeyEvent>(),
        136usize,
        concat!("Size of: ", stringify!(CorsairKeyEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairKeyEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(CorsairKeyEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairKeyEvent>())).deviceId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairKeyEvent),
            "::",
            stringify!(deviceId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairKeyEvent>())).keyId as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairKeyEvent),
            "::",
            stringify!(keyId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairKeyEvent>())).isPressed as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairKeyEvent),
            "::",
            stringify!(isPressed)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CorsairEvent {
    pub id: CorsairEventId,
    pub event_union: CorsairEventUnion,
}

unsafe impl Send for CorsairEventUnion {}
unsafe impl Sync for CorsairEventUnion {}

#[repr(C)]
#[derive(Copy, Clone)]
pub union CorsairEventUnion {
    pub deviceConnectionStatusChangedEvent: *const CorsairDeviceConnectionStatusChangedEvent,
    pub keyEvent: *const CorsairKeyEvent,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_CorsairEvent__CorsairEventUnion() {
    assert_eq!(
        ::std::mem::size_of::<CorsairEventUnion>(),
        8usize,
        concat!("Size of: ", stringify!(CorsairEventUnion))
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairEventUnion>(),
        8usize,
        concat!("Alignment of ", stringify!(CorsairEventUnion))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CorsairEventUnion>())).deviceConnectionStatusChangedEvent
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairEventUnion),
            "::",
            stringify!(deviceConnectionStatusChangedEvent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairEventUnion>())).keyEvent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairEventUnion),
            "::",
            stringify!(keyEvent)
        )
    );
}
#[test]
fn bindgen_test_layout_CorsairEvent() {
    assert_eq!(
        ::std::mem::size_of::<CorsairEvent>(),
        16usize,
        concat!("Size of: ", stringify!(CorsairEvent))
    );
    assert_eq!(
        ::std::mem::align_of::<CorsairEvent>(),
        8usize,
        concat!("Alignment of ", stringify!(CorsairEvent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CorsairEvent>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CorsairEvent),
            "::",
            stringify!(id)
        )
    );
}

pub type CorsairEventHandler =
    ::std::option::Option<unsafe extern "C" fn(context: *mut c_void, event: *const CorsairEvent)>;

extern "C" {
    #[must_use]
    pub fn CorsairSetLedsColors(size: c_int, ledsColors: *mut CorsairLedColor) -> bool;
    #[must_use]
    pub fn CorsairSetLedsColorsBufferByDeviceIndex(
        deviceIndex: c_int,
        size: c_int,
        ledsColors: *mut CorsairLedColor,
    ) -> bool;
    #[must_use]
    pub fn CorsairSetLedsColorsFlushBuffer() -> bool;
    #[must_use]
    pub fn CorsairSetLedsColorsFlushBufferAsync(
        callback: ::std::option::Option<
            unsafe extern "C" fn(context: *mut c_void, result: bool, error: CorsairError),
        >,
        context: *mut c_void,
    ) -> bool;
    #[must_use]
    pub fn CorsairGetLedsColors(size: c_int, ledsColors: *mut CorsairLedColor) -> bool;
    #[must_use]
